## Analyse des villes de France
**Exercice 32** du cours Python Objet (PYT)

In [231]:
#importation des librairies
import pandas as pd
import os

In [232]:
#paramètres de l'application
chemin_fichier = "./Data/Villes_France"
fichier_departements = os.path.join(chemin_fichier, "departements.csv")
fichier_villes = os.path.join(chemin_fichier, "villes.csv")

In [233]:
# 1. Générez les dataframes `df_departements` et  `df_villes`
df_departements = pd.read_csv(fichier_departements, dtype={"departement_code": "string"})

df_departements

,departement_id,departement_code,departement_nom,departement_nom_uppercase,departement_slug
0,1,01,Ain,AIN,ain
1,2,02,Aisne,AISNE,aisne
2,3,03,Allier,ALLIER,allier
3,5,05,Hautes-Alpes,HAUTES-ALPES,hautes-alpes
4,4,04,Alpes-de-Haute-Provence,ALPES-DE-HAUTE-PROVENCE,alpes-de-haute-provence
...,...,...,...,...,...
96,97,976,Mayotte,MAYOTTE,mayotte
97,98,971,Guadeloupe,GUADELOUPE,guadeloupe
98,99,973,Guyane,GUYANE,guyane
99,100,972,Martinique,MARTINIQUE,martinique
100,101,974,Réunion,RÉUNION,reunion

In [234]:
df_villes = pd.read_csv(fichier_villes, dtype={"ville_departement": "string", "ville_code_commune": "string"})

df_villes

,ville_id,ville_departement,ville_nom,ville_nom_simple,ville_nom_reel,ville_code_postal,ville_commune,ville_code_commune,ville_population_2010,ville_population_1999,ville_population_2012,ville_surface,ville_longitude_deg,ville_latitude_deg,ville_longitude_dms,ville_latitude_dms,ville_zmin,ville_zmax
0,1,01,OZAN,ozan,Ozan,1190,284,1284,618,469,500,6.60,4.91667,46.38330,45456.0,462330.0,170.0,205.0
1,2,01,CORMORANCHE-SUR-SAONE,cormoranche sur saone,Cormoranche-sur-Saône,1290,123,1123,1058,903,1000,9.85,4.83333,46.23330,44953.0,461427.0,168.0,211.0
2,3,01,PLAGNE,plagne,Plagne,1130,298,1298,129,83,100,6.20,5.73333,46.18330,54342.0,461131.0,560.0,922.0
3,4,01,TOSSIAT,tossiat,Tossiat,1250,422,1422,1406,1111,1400,10.17,5.31667,46.13330,51854.0,460828.0,244.0,501.0
4,5,01,POUILLAT,pouillat,Pouillat,1250,309,1309,88,58,100,6.23,5.43333,46.33330,52542.0,461938.0,333.0,770.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36695,36825,976,SADA,sada,Sada,97640,616,97616,10195,10195,10195,10.92,45.10470,-12.84860,NaN,NaN,NaN,NaN
36696,36826,976,TSINGONI,tsingoni,Tsingoni,97680,617,97617,10454,10454,10454,34.76,45.10700,-12.78970,NaN,NaN,NaN,NaN
36697,36827,971,SAINT BARTHELEMY,st barthelemy,Saint-Barthélemy,97133,123,97123,8938,8938,8938,24.00,-62.83330,17.91670,NaN,NaN,NaN,NaN
36698,36828,971,SAINT MARTIN,st martin,Saint-Martin,97150,127,97127,36979,36979,36979,53.20,18.09130,-63.08290,NaN,NaN,NaN,NaN
36699,36830,975,SAINT PIERRE ET MIQUELON,st pierre et miquelon,Saint-Pierre-et-Miquelon,97500,501,97501,6080,6080,6080,242.00,46.71070,1.71819,NaN,NaN,NaN,NaN

In [235]:
# 2. Affichez la liste des 10 villes les plus peuplées en 2012
df_villes_plus_peuplees = df_villes \
    .sort_values("ville_population_2012", ascending=False) \
    .head(10)

df_villes_plus_peuplees[["ville_nom", "ville_population_2012"]]

         ville_nom  ville_population_2012
30438        PARIS                2211000
4441     MARSEILLE                 851400
28156         LYON                 474900
11725     TOULOUSE                 439600
2051          NICE                 344900
16756       NANTES                 283300
27304   STRASBOURG                 272100
13344  MONTPELLIER                 253000
12684     BORDEAUX                 235900
22745        LILLE                 225800

In [236]:
df_villes_plus_peuplees["ville_nom"].to_list()

['PARIS',
 'MARSEILLE',
 'LYON',
 'TOULOUSE',
 'NICE',
 'NANTES',
 'STRASBOURG',
 'MONTPELLIER',
 'BORDEAUX',
 'LILLE']

In [237]:
# 3. Obtenez la liste des 10 villes ayant la plus faible superficie
df_faible_superficie = df_villes \
    .sort_values("ville_surface") \
    .head(10)

df_faible_superficie[["ville_nom", "ville_surface"]]

                   ville_nom  ville_surface
12992   CASTELMORON-D'ALBRET           0.04
7990        PLESSIX-BALISSON           0.08
36178            VAUDHERLAND           0.09
22779                 LANNOY           0.18
33907              MALLIEVRE           0.20
13111          SAINT-ANTOINE           0.20
10280  LA FERRIERE-SUR-RISLE           0.24
26695           SAINTE-MARIE           0.28
29496           BOURG-LE-ROI           0.36
27125             MONT-LOUIS           0.39

In [238]:
df_faible_superficie["ville_nom"].to_list()

["CASTELMORON-D'ALBRET",
 'PLESSIX-BALISSON',
 'VAUDHERLAND',
 'LANNOY',
 'MALLIEVRE',
 'SAINT-ANTOINE',
 'LA FERRIERE-SUR-RISLE',
 'SAINTE-MARIE',
 'BOURG-LE-ROI',
 'MONT-LOUIS']

In [239]:
# 4.Obtenez la liste des départements d’outres-mer (le département commence par "97")
df_departements_outres_mer = df_departements[df_departements["departement_code"].str.startswith("97")]
df_departements_outres_mer

,departement_id,departement_code,departement_nom,departement_nom_uppercase,departement_slug
96,97,976,Mayotte,MAYOTTE,mayotte
97,98,971,Guadeloupe,GUADELOUPE,guadeloupe
98,99,973,Guyane,GUYANE,guyane
99,100,972,Martinique,MARTINIQUE,martinique
100,101,974,Réunion,RÉUNION,reunion

In [240]:
df_departements_outres_mer["departement_nom"].to_list()

['Mayotte', 'Guadeloupe', 'Guyane', 'Martinique', 'Réunion']

In [241]:
# 5. Obtenez le nom des 10 villes les plus peuplées en 2012, ainsi que le nom du département associé.

df_villes_plus_peuplees = df_villes.merge(df_departements, left_on="ville_departement", right_on="departement_code", how="left") \
    .sort_values("ville_population_2012", ascending=False) \
    .head(10)
    
df_villes_plus_peuplees[["ville_nom", "departement_nom", "ville_population_2012"]]

         ville_nom   departement_nom  ville_population_2012
30438        PARIS             Paris                2211000
4441     MARSEILLE  Bouches-du-Rhône                 851400
28156         LYON             Rhône                 474900
11725     TOULOUSE     Haute-Garonne                 439600
2051          NICE   Alpes-Maritimes                 344900
16756       NANTES  Loire-Atlantique                 283300
27304   STRASBOURG          Bas-Rhin                 272100
13344  MONTPELLIER           Hérault                 253000
12684     BORDEAUX           Gironde                 235900
22745        LILLE              Nord                 225800

In [242]:
# 6. Obtenez la liste du nom de chaque département, associé à son code et du nombre de communes au sein de ces départements
df_departements_nb_communes = df_departements.merge(df_villes, left_on="departement_code", right_on="ville_departement", how="left") \
    .groupby(["departement_nom", "departement_code"]) \
    .agg(nombre_communes=("ville_nom", "count")) \
    .sort_values("nombre_communes", ascending=False)

df_departements_nb_communes

                                  nombre_communes
departement_nom departement_code
Pas-de-Calais   62                            895
Aisne           02                            816
Somme           80                            782
Seine-Maritime  76                            745
Moselle         57                            730
...                                           ...
Guyane          973                            22
Mayotte         976                            17
Paris           75                              1
Corse-du-sud    2a                              0
Haute-corse     2b                              0

[101 rows x 1 columns]

In [243]:
# 7. Obtenir la liste des 10 plus grands départements, en terme de superficie
df_departements_nb_communes = df_villes.merge(df_departements, left_on="ville_departement", right_on="departement_code", how="inner") \
    .groupby("departement_nom") \
    .agg(surface=("ville_surface", "sum")) \
    .sort_values("surface", ascending=False)

df_departements_nb_communes.head(10)

                       surface
departement_nom
Guyane                83531.00
Gironde                9975.59
Landes                 9242.60
Dordogne               9060.01
Côte-d'or              8763.21
Aveyron                8735.12
Saône-et-Loire         8574.69
Marne                  8161.58
Puy-de-Dôme            7969.66
Pyrénées-Atlantiques   7644.76

In [244]:
# 8. Comptez le nombre de villes dont le nom commence par "Saint".
df_villes_saint = df_villes[df_villes["ville_nom"].str.upper().str.startswith("SAINT")]
len(df_villes_saint)

4260

In [245]:
# 9. Obtenez la liste des villes qui ont un nom existants plusieurs fois
df_villes.groupby("ville_nom") \
    .agg(nombre_ville=("ville_nom", "count")) \
    .sort_values("nombre_ville", ascending=False)

                nombre_ville
ville_nom
SAINTE-COLOMBE            14
SAINT-SAUVEUR             12
BEAULIEU                  11
SAINTE-MARIE              11
SAINT-AUBIN               10
...                      ...
GIZEUX                     1
GIZAY                      1
GIZAUCOURT                 1
GIVRYCOURT                 1
ZUYTPEENE                  1

[34084 rows x 1 columns]

In [246]:
# 10. Obtenir en une seule requête SQL la liste des villes dont la superficie est supérieure à la superficie moyenne.
moyenne_surface = df_villes["ville_surface"].mean()
df_villes_grande_superficie = df_villes[df_villes["ville_surface"] > moyenne_surface]
df_villes_grande_superficie[["ville_nom", "ville_surface"]]

                      ville_nom  ville_surface
8                         PERON          26.01
20           NEUVILLE-LES-DAMES          26.59
22                     HOTONNES          28.40
24                      SONGIEU          20.58
28               CHAZEY-SUR-AIN          21.95
...                         ...            ...
36693                  OUANGANI          19.05
36696                  TSINGONI          34.76
36697          SAINT BARTHELEMY          24.00
36698              SAINT MARTIN          53.20
36699  SAINT PIERRE ET MIQUELON         242.00

[10123 rows x 2 columns]

In [247]:
df_villes_grande_superficie["ville_nom"].head(10).to_list()

['PERON',
 'NEUVILLE-LES-DAMES',
 'HOTONNES',
 'SONGIEU',
 'CHAZEY-SUR-AIN',
 'CULOZ',
 'MARBOZ',
 'FOISSIAT',
 'TREFFORT-CUISIAT',
 'SAINT-ETIENNE-DU-BOIS']

In [248]:
# 11. Obtenez la liste des départements qui possèdent plus de 2 millions d’habitants
df_departements_somme_habitants = df_villes.merge(df_departements, left_on="ville_departement", right_on="departement_code", how="inner") \
    .groupby("departement_nom") \
    .agg(somme_habitants=("ville_population_2012", "sum"))

df_departements_2m_habitants = df_departements_somme_habitants[df_departements_somme_habitants["somme_habitants"] > 2_000_000]
df_departements_2m_habitants

                 somme_habitants
departement_nom
Nord                     2565600
Paris                    2211000

In [249]:
df_departements_2m_habitants.index.to_list()

['Nord', 'Paris']

In [250]:
# 12. Dans votre DataFrame `df_villes`, remplacez les tirets par un espace vide, pour toutes les villes commençant par "SAINT-"
df_villes.loc[df_villes["ville_nom"].str.upper().str.startswith("SAINT-"), "ville_nom"] = \
    df_villes["ville_nom"].str.replace("-", " ", regex=False)

df_villes[df_villes["ville_nom"].str.upper().str.startswith("SAINT")]

,ville_id,ville_departement,ville_nom,ville_nom_simple,ville_nom_reel,ville_code_postal,ville_commune,ville_code_commune,ville_population_2010,ville_population_1999,ville_population_2012,ville_surface,ville_longitude_deg,ville_latitude_deg,ville_longitude_dms,ville_latitude_dms,ville_zmin,ville_zmax
15,16,01,SAINT BERNARD,saint bernard,Saint-Bernard,1600,339,1339,1375,1281,1400,3.15,4.73723,45.94500,44414.0,455642.0,167.0,198.0
23,24,01,SAINT SORLIN EN BUGEY,saint sorlin en bugey,Saint-Sorlin-en-Bugey,1150,386,1386,1061,938,1100,9.07,5.36667,45.88330,52214.0,455306.0,196.0,700.0
26,27,01,SAINT DENIS EN BUGEY,saint denis en bugey,Saint-Denis-en-Bugey,1500,345,1345,2178,1939,2100,2.61,5.33333,45.95000,51945.0,455707.0,234.0,338.0
36,37,01,SAINT ETIENNE DU BOIS,saint etienne du bois,Saint-Étienne-du-Bois,1370,350,1350,2441,2045,2400,28.38,5.28333,46.28330,51736.0,461717.0,213.0,259.0
38,39,01,SAINT TRIVIER SUR MOIGNANS,saint trivier sur moignans,Saint-Trivier-sur-Moignans,1990,389,1389,1877,1537,1900,41.99,4.90000,46.06670,45354.0,460424.0,230.0,289.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36674,36675,974,SAINTE-ROSE,ste rose,Sainte-Rose,97439,419,97419,6806,6545,6806,177.00,0.00000,0.00000,NaN,NaN,NaN,NaN
36675,36676,974,SAINTE-SUZANNE,ste suzanne,Sainte-Suzanne,97441,420,97420,22421,18137,22421,57.00,0.00000,0.00000,NaN,NaN,NaN,NaN
36697,36827,971,SAINT BARTHELEMY,st barthelemy,Saint-Barthélemy,97133,123,97123,8938,8938,8938,24.00,-62.83330,17.91670,NaN,NaN,NaN,NaN
36698,36828,971,SAINT MARTIN,st martin,Saint-Martin,97150,127,97127,36979,36979,36979,53.20,18.09130,-63.08290,NaN,NaN,NaN,NaN
36699,36830,975,SAINT PIERRE ET MIQUELON,st pierre et miquelon,Saint-Pierre-et-Miquelon,97500,501,97501,6080,6080,6080,242.00,46.71070,1.71819,NaN,NaN,NaN,NaN